// problem 1
// მომხმარებელს მოთხოვეთ რომ შეიყვანოს რიცხვი, თუ კენტ რიცხვს შეიყვანს კონსოლში დაბეჭდეთ
// რომ მომხმარებელმა შეიყვანა კენტი რიცხვი თუ ლუწს შეიყვანს მაშინ შესაბამისად კონსოლში დაბეჭდეთ
// რომ მომხარებელმა შეიყვანა ლუწი რიცხვი.
// (მომხმარებლისგან ინფორმაციის მისაღებად გამოიყენეთ prompt() ფუნქცია,)
// (კონსოლში დასაბეჭდათ გამოიყენეთ console.log() ფუნქცია )

// problem 2
// მომხმარებელს მოთხოვეთ რომ შეიყვანოს მისთვის საყვარელი ხილი
// ვაშლის შემთხვევაში კონსოლში დაბეჭდეთ რომ 'ვაშლი კარგი არჩევანია ! '
// მსხლის შემთხვევაში კონსოლში დაბეჭდეთ რომ 'მსხალი სჯობს! '
// ყურძნის შემთხვევაში კონსოლში დაბეჭდეთ რომ 'ყურძენი საუკეთესოა! '
// სურვილის შემთხვევაში დაამატეთ რამდენი ვარიანტიც გინდათ
// სხვა შემთხვევებში (თუ ისეთ ხილს შეიყვანს მომხმარებელი რომელიც ჩვენ არ გვიწერია ან ზოგადად ხილს არ შეიყვანს)
// კონსოლში დაბეჭდეთ "მოცემული მნიშვნელობა არ არის ჩვენს სიაში."
// დავალება შეასრულეთ Switch გამოყენებით

// problem 3
// კონსოლში დაბეჭდეთ 1-100 მდე ყველა ლუწი რიცხვი (დაგჭირდება Loop)

// problem4
// მომხმარებელს მოთხოვეთ რომ შეიყვანოს რიცხვები მანამ სანამ არ შეიყვანს უარყოფით რიცხვს

// problems 5
// let numbers = [10,12,42,55,100,90,32,55];
// let result=[];
// numbers მასივში იპოვეთ რიცხვები რომელიც იყოფა 5-ზე ლუპის საშუალებით,
// შეინახეთ result მასივში.

// problem 6
// let names = ["Gio","Luka","Nika","Ani","Eka","Nini","Sopo"];
// კონსოლში დაბეჭდეთ names მასივში არსებული ყველა ელემენტი, გამოტოვეთ მხოლოდ ნიკა.
// ლუპის საშუალებით.

// problem7

// Loop-ს დახმარებით იპოვეთ და დააბრუნეთ  მასივში ყველაზე დიდ რიცხვს.

// const numbers = [
//   1, 4, 2, 14, 90, 13, 2, 0, 78, 199, 12, 313, 315, 789, 31, 12, 1, 1, 3467, 90,
//   70, 34, 43, 189,
// ];

// problem8

// Loop-ს დახმარებით იპოვეთ და დააბრუნეთ  მასივში ყველაზე პატარა რიცხვს.

// const numbers = [
//     1, 4, 2, 14, 90, 13, 2, 0, 78, 199, 12, 313, 315, 789, 31, 12, 1, 1, 3467, 90,
//     70, 34, 43, 189,
//   ];

// Have fun :) :)
